-- 5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, 
-- виконати команду зміни значення колонки зовнішнього ключа на значення, яке 
-- відсутнє в колонці первинного ключа відповідної таблиці. Перевірити реакцію 
-- СКБД на таку зміну.
UPDATE List_Of_Services
SET Service_implementer = 75
WHERE 
    List_id = 1;
/*
ERROR at line 1:
ORA-02291: integrity constraint (BONDARENKO.SERVICE_IMPLEMENTER_FK) violated -
parent key not found
*/

-- 5.2 Повторити рішення завдання 5.1, але таке, що не призводить до порушення 
-- цілісності зовнішнього ключа.
UPDATE List_Of_Services
SET Service_implementer = 2
WHERE 
    List_id = 1;
/*
1 row updated.
*/

-- 5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, 
--пов'язане з колонкою зовнішнього ключа іншої таблиці, виконати одну команду 
--видалення рядка зі значенням колонки первинного ключа, що є в колонці 
--зовнішнього ключа іншої таблиці. Перевірити реакцію СКБД видалення.
DELETE FROM Implementers
WHERE 
    Implem_id = 58;
/*
ERROR at line 1:
ORA-02292: integrity constraint (BONDARENKO.SERVICE_IMPLEMENTER_FK) violated -
child record found
*/

-- 5.4 Повторити рішення завдання 5.3, але таке, що не призводить до порушення 
-- цілісності зовнішнього ключа.
DELETE FROM Implementers
WHERE 
    Implem_id = 4;
/*
1 rows deleted.
*/

-- 5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, 
--виконати команду зміни значення колонки первинного ключа на значення, яке 
--присутнє у колонці зовнішнього ключа відповідної таблиці. Перевірити реакцію 
--СКБД на таку зміну.
UPDATE Implementers
SET Implem_Id = 2
WHERE 
    Implem_Id = 4;
/*
   ERROR at line 1:
ORA-00001: unique constraint (BONDARENKO.IMPLEM_ID_PK) violated
*/

--5.6 Повторити рішення завдання 5.5, але таке, що не призводить до порушення 
--цілісності зовнішнього ключа, тобто виконати команду зміни значення колонки 
--первинного ключа на значення, яке вже не присутнє у колонці зовнішнього ключа 
--відповідної таблиці.
UPDATE Implementers
SET Implem_Id = 6
WHERE 
    Implem_Id = 4;
/*
1 row updated.
*/
    